/**
 * \mainpage
 * # ЛЛабораторна робота №9

Коломійцев В.О.:КН-922Б

27.05.2023

 */
/*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу,
виклики функцій   lab05, lab06 та значення для аргументів цих функцій.
*/

#include <stdio.h>

#include <stdlib.h>

#include <time.h>

#include "lib.h"

/**
 Головна функція.

 Послідовність дій

- Присвоїти значення аргументам argc і argv.
\param argc - аргумент типу int необхідний для обчислення всіх щасливих
квитків. \param argv - масив типу char який зберігатиме в собі значення від
якого почнеться перевірка всіх квитків.

- Створення змінних яким буде надано значення для аргументів функцій link
lab05, lab06.

 t - зберігає значення за умовчуванням від якого буде починатися перевірка
квитків для функції lab06. Воно буде використовуватися якщо не будуть передані
аргументи командного рядка.

 x - зберігає рандомне значення, яке є мінімальним числом в діапазоні для
функції lab05.

 y - зберігає рандомне значення, яке є максимальним числом в діапазоні для
функції lab05.

 c - змінна яка використовується для перевірки аргументів командного рядка.

- Гненеруємо рандомні числа за допомогою генератора rand() та функції srand(),
після чого привласнюємо їх пріменним x і y.

- Потім викликаємо функцію lab05 і присвоюємо її аргументам значення примінних
x та y.

Функція lab05
 \param x, y - діапазон в якому буде знаходитися найбільше просте число
 \return успішний код повернення з програми (0)

- Робимо перевірку на те, чи були введені аргументи через командний рядок.

- Якщо перевірка була пройдена, то переобразуємо аргумент командного рядка в
значення типу int і присвоюємо його примінній t

- Робимо перевірку, чи менше t мінімального значення квитка 1000.

- Якщо перевірка була пройдена то присвоюємо t аргументам функції lab06

- Якщо одна з перевірок не була пройдена, то присвоюємо аргументам функції
lab06 значення за замовчуванням.

Функція lab06
 \param t - Число від якого розпочнеться перевірка квитків
 \return успішний код повернення з програми (0)
 */

int main(int argc, char *argv[])

{
	long int t = 1000;

	int x, y;

	char *c;

	srand((unsigned int)time(NULL));

	x = rand() % 11;

	y = rand() % (x - 1);

	lab05(x, y);

	if (argc > 1)

	{
		t = strtol(argv[1], &c, 10);

		if (t > 1000 && t < 9999)

		{
			lab06(t,0);
		}

	} else

	{
		lab06(t,0);
	}

	return 0;
}
